#include <iostream>
using namespace std;

void mainmanu(){										//主菜单
	cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"******   Small Staff Management System   *****"<<endl;
	cout<<"      --- Please choose the opration. ---"<<endl;
	cout<<"             1.添加职员：                     "<<endl;
	cout<<"             2.删除职员：                     "<<endl;
	cout<<"             3.查找职员：                     "<<endl;
	cout<<"             4.显示所有：                     "<<endl;
	cout<<"             5.退出系统：                     "<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
}

void submanu1(){										//添加职员子菜单
    cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"******   Small Staff Management System   *****"<<endl;
	cout<<"   ---     请选择需要添加职员的类型.     ---"<<endl;
	cout<<"            1.经理 ：                     "<<endl;
	cout<<"            2.技术人员 ：                     "<<endl;
	cout<<"            3.销售员 ：                     "<<endl;
	cout<<"            4.销售经理 ：                     "<<endl;
	cout<<"            5.返回主菜单 ：                     "<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
}

void submanu2(){									//删除成员子菜单
    cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"******   Small Staff Management System   *****"<<endl;
	cout<<"   ---     请选择需要删除职员的类型.     ---"<<endl;
	cout<<"            1.经理 ：                     "<<endl;
	cout<<"            2.技术人员 ：                     "<<endl;
	cout<<"            3.销售员 ：                     "<<endl;
	cout<<"            4.销售经理 ：                     "<<endl;
	cout<<"            5.返回主菜单 ：                     "<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
}

void submanu3(){									//查找成员子菜单
    cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"******   Small Staff Management System   *****"<<endl;
	cout<<"   ---     请选择需要查找职员的类型.     ---"<<endl;
	cout<<"            1.经理 ：                     "<<endl;
	cout<<"            2.技术人员 ：                     "<<endl;
	cout<<"            3.销售员 ：                     "<<endl;
	cout<<"            4.销售经理 ：                     "<<endl;
	cout<<"            5.返回主菜单 ：                     "<<endl;
	cout<<"**********************************************"<<endl;
	cout<<"**********************************************"<<endl;
}