//***************************************************************************************/
//*		CCF软件能力认证考试模拟题 —— 相反数(计算一组数中相反数的个数）	皮皮 2014-9-19		*/
//***************************************************************************************/
#include <stdio.h>

int revNum(){
	int n, num[500];

	scanf("%d", &n);
	for(int i = 0; i < n; i++)
		scanf("%d", &num[i]);

	int rev_num = 0;
	for(int i = 0; i < n; i++){
		for(int j = i + 1; j < n; j++){
			if(num[i] == -num[j])
				rev_num++;
		}
	}
	return rev_num;
}

int __62651296216main(){
	printf("%d\n", revNum());
	return 0;
}

//test cases:
//5
//1 2 3 -1 -2
//6
//12 -12 12 -12 -12 12
